In [1]:
import pandas as pd

In [15]:
df = pd.read_csv('studentsperformance.csv')
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

df.head() lo conociste en la clase anterior y retorna las 5 primeras filas. También podemos darle un entero como parámetro y devolverá esa cantidad de primeras filas dentro del notebook.

In [16]:
df.head(3)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93

df.tail() retorna las 5 últimas filas. También podemos darle un entero como parámetro y devolverá esa cantidad de últimas filas.

In [17]:
df.tail()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

df.sample() retorna filas como los dos métodos anteriores, pero toma muestras al azar del DataFrame y es necesario especificar en el parámetro la cantidad de filas.

In [18]:
df.sample(7)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
157,male,group B,some college,free/reduced,none,60,60,60
426,male,group C,bachelor's degree,standard,none,86,83,86
417,male,group C,associate's degree,standard,none,74,73,67
714,female,group B,some high school,standard,completed,60,70,74
299,male,group D,associate's degree,free/reduced,none,90,87,75
422,female,group D,master's degree,free/reduced,completed,47,58,67
790,female,group B,high school,standard,none,48,62,60

df.shape retorna la cantidad de filas y columnas que tiene el DataFrame en ese orden.

In [19]:
df.shape

(1000, 8)

df.size multiplica las filas y columnas y te da el total de datos del DataFrame.

In [20]:
df.size

8000

df.info() da la cuenta de valores no nulos, el tipo de dato de cada columna (recuerda que solo puede haber un único tipo de dato por columna) y el uso de memoria.

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

df.describe() calcula algunas estadísticas descriptivas para cada columna.

In [23]:
df.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

Para ver las columnas de un DafaFrame usamos el método df.columns.

In [25]:
df.columns
# >>> Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
#        'test preparation course', 'math score', 'reading score',
#        'writing score'],
#       dtype='object')

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

In [26]:
df['math score']

0      72
1      69
2      90
3      47
4      76
       ..
995    88
996    62
997    59
998    68
999    77
Name: math score, Length: 1000, dtype: int64

In [29]:
df['math score'].mean()

66.089

In [30]:
df['math score'].median()

66.0

In [31]:
df['math score'].std()

15.16308009600945